# Series()

In [3]:
import numpy as np
import pandas as pd

In [4]:
labels = ['a','b','c']
my_data = [10,20,30]
table2 = [range(2,21,2)]
diction = {'p':100,'q':200,'r':300}
arr = np.array(my_data)
ser = pd.Series(my_data)

In [5]:
ser

0    10
1    20
2    30
dtype: int64

In [6]:
ser0 = pd.Series(my_data,diction)

In [7]:
ser0

p    10
q    20
r    30
dtype: int64

In [8]:
ser01 = pd.Series(my_data,labels)
ser01

a    10
b    20
c    30
dtype: int64

# A Series() can hold any kind of data, provided both the index and values are of equal numbers.

In [9]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

# addition of two Series()

In [10]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [11]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [12]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

IN CALCULATING THE SUM, ITEMS OF UNCOMMON INDEX WILL BE REPESENTED BY NaNa. MATCHING THE INDEX ADDIND THE VALUES.

pd.Series(values,index)

In [13]:
ser1[0]

1

In [14]:
ser2['USA']

1

# DataFrame()

In [4]:
from numpy.random import randn
np.random.seed(101)
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [5]:
df[['W']]             #INDEXING OF COLUMNS ONLY

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [6]:
type(df['W'])

pandas.core.series.Series

In [7]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [8]:
df1 = df[['X','Y']]

In [9]:
df1

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967

In [10]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Adding 'new' column to existing DataFrame

In [11]:
df['NEW'] = df['W'] + df['Z']       # Column to Column addition: will add corresponding elements of the column
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [12]:
df ['NEW_AGAIN'] = pd.Series([100,200,300,400,500],['A','B','C','D','E'])

In [13]:
df

          W         X         Y         Z       NEW  NEW_AGAIN
A  2.706850  0.628133  0.907969  0.503826  3.210676        100
B  0.651118 -0.319318 -0.848077  0.605965  1.257083        200
C -2.018168  0.740122  0.528813 -0.589001 -2.607169        300
D  0.188695 -0.758872 -0.933237  0.955057  1.143752        400
E  0.190794  1.978757  2.605967  0.683509  0.874303        500

drop() Elemnts from DataFrame()

In [14]:
df.drop('A',axis= 0)

          W         X         Y         Z       NEW  NEW_AGAIN
B  0.651118 -0.319318 -0.848077  0.605965  1.257083        200
C -2.018168  0.740122  0.528813 -0.589001 -2.607169        300
D  0.188695 -0.758872 -0.933237  0.955057  1.143752        400
E  0.190794  1.978757  2.605967  0.683509  0.874303        500

In [15]:
df.drop('NEW',axis=1)                  # axis =1, for column and axis= 0 (Default)

          W         X         Y         Z  NEW_AGAIN
A  2.706850  0.628133  0.907969  0.503826        100
B  0.651118 -0.319318 -0.848077  0.605965        200
C -2.018168  0.740122  0.528813 -0.589001        300
D  0.188695 -0.758872 -0.933237  0.955057        400
E  0.190794  1.978757  2.605967  0.683509        500

In [16]:
df          #above deletion does not alter the DataFrame "df",  however, changes can be stored in another variable.

          W         X         Y         Z       NEW  NEW_AGAIN
A  2.706850  0.628133  0.907969  0.503826  3.210676        100
B  0.651118 -0.319318 -0.848077  0.605965  1.257083        200
C -2.018168  0.740122  0.528813 -0.589001 -2.607169        300
D  0.188695 -0.758872 -0.933237  0.955057  1.143752        400
E  0.190794  1.978757  2.605967  0.683509  0.874303        500

In [17]:
df.drop('NEW', axis = 1, inplace = True)          #here "inplace =True", will alter the DataFrame(df) permanentaly.

In [18]:
df

          W         X         Y         Z  NEW_AGAIN
A  2.706850  0.628133  0.907969  0.503826        100
B  0.651118 -0.319318 -0.848077  0.605965        200
C -2.018168  0.740122  0.528813 -0.589001        300
D  0.188695 -0.758872 -0.933237  0.955057        400
E  0.190794  1.978757  2.605967  0.683509        500

In [19]:
df.shape    # information of rows(0) and column(1), is stored in tuple. So, axis =0 for row and axis =1 for column.

(5, 5)

.loc[]  /  .iloc[]        #Indexing of rows and column simultaneously

In [20]:
type(df.loc['A'])

pandas.core.series.Series

In [21]:
df.loc['A']

W              2.706850
X              0.628133
Y              0.907969
Z              0.503826
NEW_AGAIN    100.000000
Name: A, dtype: float64

In [22]:
type(df.loc[['A']])         # Returns only the values of row A in tabular form(DataFrame)

pandas.core.frame.DataFrame

In [23]:
df.loc[['A']]            # CALLED BY INDEX

         W         X         Y         Z  NEW_AGAIN
A  2.70685  0.628133  0.907969  0.503826        100

In [37]:
df.loc['A':]

          W         X         Y         Z  NEW_AGAIN
A  2.706850  0.628133  0.907969  0.503826        100
B  0.651118 -0.319318 -0.848077  0.605965        200
C -2.018168  0.740122  0.528813 -0.589001        300
D  0.188695 -0.758872 -0.933237  0.955057        400
E  0.190794  1.978757  2.605967  0.683509        500

In [46]:
df.loc['A':'C', 'W']            #slicing of rows, for given column: note: slicing is possible inside loc[], but not in list within loc[]. i.e. loc[[<list_of_row>]]

A    2.706850
B    0.651118
C   -2.018168
Name: W, dtype: float64

In [47]:
df.loc[df['W']>0]           #coditional slicing

          W         X         Y         Z  NEW_AGAIN
A  2.706850  0.628133  0.907969  0.503826        100
B  0.651118 -0.319318 -0.848077  0.605965        200
D  0.188695 -0.758872 -0.933237  0.955057        400
E  0.190794  1.978757  2.605967  0.683509        500

In [48]:
df.loc[df['X']>0,'Z' ]

A    0.503826
C   -0.589001
E    0.683509
Name: Z, dtype: float64

In [49]:
df.loc[lambda df: df['W']>0]     # .loc[lambda...] is only for column conditions,neither for row conditions nor operations

          W         X         Y         Z  NEW_AGAIN
A  2.706850  0.628133  0.907969  0.503826        100
B  0.651118 -0.319318 -0.848077  0.605965        200
D  0.188695 -0.758872 -0.933237  0.955057        400
E  0.190794  1.978757  2.605967  0.683509        500

In [50]:
df.loc['B','W']     #returns the value of location. loc[<row_index>,<column_index>]

0.6511179479432686

In [51]:
df.loc[['B','C'],['X','Z']]         # no slicing can be done inside list_row or inside list_column

           X         Z
B  -0.319318  0.605965
C  30.000000 -0.589001

In [52]:
df.loc[['C'],['X','Y','NEW_AGAIN']]

      X     Y  NEW_AGAIN
C  30.0  30.0        300

In [53]:
df.loc[['C'],['X','Y']]=30    # setting values to provided location

In [54]:
df.loc[['C'],['Y','X','NEW_AGAIN']]

      Y     X  NEW_AGAIN
C  30.0  30.0        300

# Multi-level Index
like multi-dimension array

In [69]:
snakes = [ ('cobra', 'mark i'),
          ('cobra', 'mark ii'), 
          ('sidewinder', 'mark i'),
          ('sidewinder', 'mark ii'),
          ('viper', 'mark ii'),
          ('viper', 'mark iii') ]
index = pd.MultiIndex.from_tuples(snakes)
values = [[12, 2], [0, 4], [10, 20], [1, 4], [7, 1], [16, 36]]
df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)

In [70]:
df

                     max_speed  shield
cobra      mark i           12       2
           mark ii           0       4
sidewinder mark i           10      20
           mark ii           1       4
viper      mark ii           7       1
           mark iii         16      36

In [71]:
df.loc[('cobra', 'mark i'), 'shield']

2

In [72]:
df.loc[('sidewinder','mark ii'): ]   # slicing this multi-row index

                     max_speed  shield
sidewinder mark ii           1       4
viper      mark ii           7       1
           mark iii         16      36

In [73]:
df.loc[('viper','mark iii'),['max_speed','shield']]=30    # setting values for multi-indexed location

In [74]:
df

                     max_speed  shield
cobra      mark i           12       2
           mark ii           0       4
sidewinder mark i           10      20
           mark ii           1       4
viper      mark ii           7       1
           mark iii         30      30

In [75]:
df>2

                     max_speed  shield
cobra      mark i         True   False
           mark ii       False    True
sidewinder mark i         True    True
           mark ii       False    True
viper      mark ii        True   False
           mark iii       True    True

In [76]:
df[df>2]

                     max_speed  shield
cobra      mark i         12.0     NaN
           mark ii         NaN     4.0
sidewinder mark i         10.0    20.0
           mark ii         NaN     4.0
viper      mark ii         7.0     NaN
           mark iii       30.0    30.0

In [84]:
df[(df['max_speed']>0) &  (df['shield']<10)]

                    max_speed  shield
cobra      mark i          12       2
sidewinder mark ii          1       4
viper      mark ii          7       1

In [85]:
df[(df['max_speed']>10) | df['max_speed']<30]

                     max_speed  shield
cobra      mark i           12       2
           mark ii           0       4
sidewinder mark i           10      20
           mark ii           1       4
viper      mark ii           7       1
           mark iii         30      30

In [91]:
list1 = [1,2,3,4,5]
list2 = [6,7,8,9,0]
list3 = list(zip(list1,list2))  # zip()
list3

[(1, 6), (2, 7), (3, 8), (4, 9), (5, 0)]

#  .split()    &  .reset_index()

In [92]:
list4 = 'my name is prince'.split()
list4

['my', 'name', 'is', 'prince']

In [94]:
list5 = 'my phone number is 0751'.split()
list5

['my', 'phone', 'number', 'is', '0751']

In [103]:
d = {'my': [1,2,3,], 'name': [4,5,6,],'is':[7,8,9]}    #creation of a DataFrame from a Dictionary
df2 = pd.DataFrame(d)#,index = ['a','b','c'])
df2                                            # Here, 'key' becomes column amd its values become column values

   my  name  is
0   1     4   7
1   2     5   8
2   3     6   9

In [ ]:
df3 = pd.DataFrame